### Join statements

In [1]:
# load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook
%load_ext sql

# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

'Connected: @chinook.db'

In [2]:
%%sql

SELECT 
    a.AlbumId, 
    a.Title AS "Album Title", 
    t.Name AS "Track Name"
FROM 
    albums a
INNER JOIN 
    tracks AS t
    ON a.Title = t.Name
LIMIT 10;  -- Remove this line to see the full query output

 * sqlite:///chinook.db
Done.

[(2, 'Balls to the Wall', 'Balls to the Wall'),
 (3, 'Restless and Wild', 'Restless and Wild'),
 (4, 'Let There Be Rock', 'Let There Be Rock'),
 (152, 'Master Of Puppets', 'Master Of Puppets'),
 (11, 'Out Of Exile', 'Out Of Exile'),
 (16, 'Black Sabbath', 'Black Sabbath'),
 (18, 'Body Count', 'Body Count'),
 (19, 'Chemical Wedding', 'Chemical Wedding'),
 (21, 'Prenda Minha', 'Prenda Minha'),
 (23, 'Minha Historia', 'Minha Historia')]

In [3]:
%%sql

SELECT 
    a.AlbumId, 
    a.Title AS "Album Title", 
    t.Name AS "Track Name", 
    ar.Name AS "Artist Name"
FROM 
    albums AS a
INNER JOIN 
    tracks AS t
    ON a.Title = t.Name
INNER JOIN 
    artists AS ar
    ON ar.ArtistId = a.ArtistId
LIMIT 10;  -- Remove this line to see the full query output

 * sqlite:///chinook.db
Done.

[(2, 'Balls to the Wall', 'Balls to the Wall', 'Accept'),
 (3, 'Restless and Wild', 'Restless and Wild', 'Accept'),
 (4, 'Let There Be Rock', 'Let There Be Rock', 'AC/DC'),
 (11, 'Out Of Exile', 'Out Of Exile', 'Audioslave'),
 (16, 'Black Sabbath', 'Black Sabbath', 'Black Sabbath'),
 (16, 'Black Sabbath', 'Black Sabbath', 'Black Sabbath'),
 (18, 'Body Count', 'Body Count', 'Body Count'),
 (19, 'Chemical Wedding', 'Chemical Wedding', 'Bruce Dickinson'),
 (21, 'Prenda Minha', 'Prenda Minha', 'Caetano Veloso'),
 (23, 'Minha Historia', 'Minha Historia', 'Chico Buarque')]

In [4]:
%%sql

SELECT 
    t.TrackId, 
    ii.InvoiceId
FROM 
    tracks t
LEFT JOIN 
    invoice_items ii
    ON t.TrackId = ii.TrackId
LIMIT 10;  -- Remove this line to see the full query output

 * sqlite:///chinook.db
Done.

[(1, 108),
 (6, 2),
 (7, None),
 (8, 2),
 (8, 214),
 (9, 108),
 (9, 319),
 (10, 2),
 (11, None),
 (12, 2)]

In [5]:
%%sql

SELECT 
    t.TrackId, 
    ii.InvoiceId
FROM 
    tracks AS t
LEFT JOIN 
    invoice_items AS ii
    ON t.TrackId = ii.TrackId
WHERE ii.InvoiceId IS NULL
LIMIT 10;  -- Remove this line to see the full query output

 * sqlite:///chinook.db
Done.

[(7, None),
 (11, None),
 (17, None),
 (18, None),
 (22, None),
 (23, None),
 (27, None),
 (29, None),
 (33, None),
 (34, None)]

In [6]:
%%sql

SELECT 
    g.Name AS "Genre", 
    m.Name AS "Media Type"
FROM 
    genres AS g
CROSS JOIN 
    media_types AS m
LIMIT 10;  -- Remove this line to see the full query output

 * sqlite:///chinook.db
Done.

[('Rock', 'MPEG audio file'),
 ('Rock', 'Protected AAC audio file'),
 ('Rock', 'Protected MPEG-4 video file'),
 ('Rock', 'Purchased AAC audio file'),
 ('Rock', 'AAC audio file'),
 ('Jazz', 'MPEG audio file'),
 ('Jazz', 'Protected AAC audio file'),
 ('Jazz', 'Protected MPEG-4 video file'),
 ('Jazz', 'Purchased AAC audio file'),
 ('Jazz', 'AAC audio file')]